{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v1.7.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_layer": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "14"}, {"size": "14"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_3/tf.math.multiply_9/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_8/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_7/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/AvgPool/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_7/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_6/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_5/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_4/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/AvgPool/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_4/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_3/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_2/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_1/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/AvgPool/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/rescaling/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/rescaling/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/depthwise/pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_5/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_6/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_8/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_9/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_3/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/output_layer/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/output_layer/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/Conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_5/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "112"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_5/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "112"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "112"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "144"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_5/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "160"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_5/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/project/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/expand/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/expand/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/depthwise/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/project/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_3/rescaling/mul", "op": "Mul", "input": ["input_1", "StatefulPartitionedCall/model_3/rescaling/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/rescaling/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/rescaling/mul", "StatefulPartitionedCall/model_3/rescaling/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/Conv/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/rescaling/add", "StatefulPartitionedCall/model_3/Conv/Conv2D_weights", "StatefulPartitionedCall/model_3/Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply/Mul/y", "StatefulPartitionedCall/model_3/Conv/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/Conv/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/tf.__operators__.add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/multiply/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply/Mul", "StatefulPartitionedCall/model_3/re_lu/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/depthwise/pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_3/multiply/mul", "StatefulPartitionedCall/model_3/expanded_conv/depthwise/pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model_3/expanded_conv/depthwise/pad/Pad", "StatefulPartitionedCall/model_3/expanded_conv/depthwise/depthwise_weights", "StatefulPartitionedCall/model_3/expanded_conv/depthwise/depthwise_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/AvgPool/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_3/expanded_conv/depthwise/depthwise", "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/AvgPool/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Relu/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/AvgPool/Mean", "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Relu/Relu", "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_1/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Conv_1/BiasAdd", "StatefulPartitionedCall/model_3/tf.__operators__.add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_2/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_1/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_1/Mul/y", "StatefulPartitionedCall/model_3/re_lu_2/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Mul/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_1/Mul", "StatefulPartitionedCall/model_3/expanded_conv/depthwise/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv/project/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv/squeeze_excite/Mul/mul", "StatefulPartitionedCall/model_3/expanded_conv/project/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv/project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv/project/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/expanded_conv_1/expand/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_1/expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_3/re_lu_3/Relu", "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/pad/Pad", "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/depthwise_weights", "StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/depthwise_bn_offset"], "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_1/project/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_1/depthwise/depthwise", "StatefulPartitionedCall/model_3/expanded_conv_1/project/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_1/project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_1/project/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/expanded_conv_2/expand/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_2/expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model_3/re_lu_5/Relu", "StatefulPartitionedCall/model_3/expanded_conv_2/depthwise/depthwise_weights", "StatefulPartitionedCall/model_3/expanded_conv_2/depthwise/depthwise_bn_offset"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/project/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_2/depthwise/depthwise", "StatefulPartitionedCall/model_3/expanded_conv_2/project/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_2/project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_2/Add/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_1/project/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/expanded_conv_2/project/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_2/Add/add", "StatefulPartitionedCall/model_3/expanded_conv_3/expand/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_3/expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_2/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_2/Mul/y", "StatefulPartitionedCall/model_3/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_2/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/expand/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/tf.__operators__.add_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_7/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_2/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/multiply_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_2/Mul", "StatefulPartitionedCall/model_3/re_lu_7/Relu6"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_3/multiply_1/mul", "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/pad/Pad", "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/depthwise_weights", "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/depthwise_bn_offset"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_3/Mul/y", "StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/depthwise"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_3/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/depthwise/depthwise", "StatefulPartitionedCall/model_3/tf.__operators__.add_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_8/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_3/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/multiply_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_3/Mul", "StatefulPartitionedCall/model_3/re_lu_8/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/AvgPool/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_3/multiply_2/mul", "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/AvgPool/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Relu/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/AvgPool/Mean", "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Relu/Relu", "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_4/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Conv_1/BiasAdd", "StatefulPartitionedCall/model_3/tf.__operators__.add_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_9/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_4/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_4/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_4/Mul/y", "StatefulPartitionedCall/model_3/re_lu_9/Relu6"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Mul/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_4/Mul", "StatefulPartitionedCall/model_3/multiply_2/mul"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_3/project/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/squeeze_excite/Mul/mul", "StatefulPartitionedCall/model_3/expanded_conv_3/project/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_3/project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/project/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/expanded_conv_4/expand/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_4/expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_5/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_5/Mul/y", "StatefulPartitionedCall/model_3/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_5/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_4/expand/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/tf.__operators__.add_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_10/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_5/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/multiply_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_5/Mul", "StatefulPartitionedCall/model_3/re_lu_10/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model_3/multiply_3/mul", "StatefulPartitionedCall/model_3/expanded_conv_4/depthwise/depthwise_weights", "StatefulPartitionedCall/model_3/expanded_conv_4/depthwise/depthwise_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_6/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_6/Mul/y", "StatefulPartitionedCall/model_3/expanded_conv_4/depthwise/depthwise"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_6/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_4/depthwise/depthwise", "StatefulPartitionedCall/model_3/tf.__operators__.add_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_11/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_6/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/multiply_4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_6/Mul", "StatefulPartitionedCall/model_3/re_lu_11/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/AvgPool/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_3/multiply_4/mul", "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/AvgPool/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Relu/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/AvgPool/Mean", "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Relu/Relu", "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_7/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Conv_1/BiasAdd", "StatefulPartitionedCall/model_3/tf.__operators__.add_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_12/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_7/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_7/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_7/Mul/y", "StatefulPartitionedCall/model_3/re_lu_12/Relu6"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Mul/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_7/Mul", "StatefulPartitionedCall/model_3/multiply_4/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/project/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_4/squeeze_excite/Mul/mul", "StatefulPartitionedCall/model_3/expanded_conv_4/project/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_4/project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_4/Add/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_3/project/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/expanded_conv_4/project/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_5/expand/BatchNorm/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/expanded_conv_4/Add/add", "StatefulPartitionedCall/model_3/expanded_conv_5/expand/Conv2D_weights", "StatefulPartitionedCall/model_3/expanded_conv_5/expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_8/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_8/Mul/y", "StatefulPartitionedCall/model_3/expanded_conv_5/expand/BatchNorm/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_8/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_5/expand/BatchNorm/FusedBatchNormV3", "StatefulPartitionedCall/model_3/tf.__operators__.add_8/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_13/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_8/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/multiply_5/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_8/Mul", "StatefulPartitionedCall/model_3/re_lu_13/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/expanded_conv_5/depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model_3/multiply_5/mul", "StatefulPartitionedCall/model_3/expanded_conv_5/depthwise/depthwise_weights", "StatefulPartitionedCall/model_3/expanded_conv_5/depthwise/depthwise_bn_offset"], "attr": {"explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_3/tf.math.multiply_9/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_9/Mul/y", "StatefulPartitionedCall/model_3/expanded_conv_5/depthwise/depthwise"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/tf.__operators__.add_9/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_3/expanded_conv_5/depthwise/depthwise", "StatefulPartitionedCall/model_3/tf.__operators__.add_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/re_lu_14/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/model_3/tf.__operators__.add_9/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_3/multiply_6/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_3/tf.math.multiply_9/Mul", "StatefulPartitionedCall/model_3/re_lu_14/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model_3/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_3/multiply_6/mul", "StatefulPartitionedCall/model_3/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_3/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": 